Minghou-Lei/esp32_ai_monitor/components/ui_service/monitor_dashboard_screen.c
/**
 * @file    monitor_dashboard_screen.c
 * @brief   基于 BSP + LVGL 的 AQI 主监控屏幕。
 *
 * 这是板上默认主视图，恢复为卡片式 AQI 大盘：主余额、可用百分比、DELTA
 * 与小时消费金额，以及底部状态区。配置页仍然通过网页提供，不再替代板上主界面。
 */

#include "wifi_info_screen.h"

#include <inttypes.h>
#include <stdbool.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "bsp/esp32_p4_wifi6_touch_lcd_4b.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "lvgl.h"
#include "network_service.h"
#include "provider_service.h"
#include "sdkconfig.h"

static const char *TAG = "wifi_info_screen";
static const uint32_t WIFI_INFO_SCREEN_DRAW_BUFFER_LINES = 20;
static const uint32_t WIFI_INFO_SCREEN_FIRST_REFRESH_MS = 200;
static const uint32_t WIFI_INFO_SCREEN_DELTA_FLASH_MS = 200;
static const int32_t WIFI_INFO_SCREEN_FONT_SIZE_SMALL = 20;
static const int32_t WIFI_INFO_SCREEN_FONT_SIZE_MEDIUM = 28;
static const int32_t WIFI_INFO_SCREEN_FONT_SIZE_BALANCE = 58;
static const int32_t WIFI_INFO_SCREEN_FONT_SIZE_DELTA = 34;
static const int32_t WIFI_INFO_SCREEN_WIFI_DOT_SIZE = 18;
static const uint32_t WIFI_INFO_SCREEN_COLOR_BLACK = 0x000000;
static const uint32_t WIFI_INFO_SCREEN_COLOR_WHITE = 0xFFFFFF;
static const uint32_t WIFI_INFO_SCREEN_COLOR_BORDER = 0xF5F5F5;
static const uint32_t WIFI_INFO_SCREEN_COLOR_AMBER = 0x7A4313;
static const uint32_t WIFI_INFO_SCREEN_COLOR_BLUE = 0x0E2A63;
static const uint32_t WIFI_INFO_SCREEN_COLOR_GREEN = 0x2F5E3B;
static const uint32_t WIFI_INFO_SCREEN_COLOR_WIFI_DOT = 0x22C55E;
static const uint32_t WIFI_INFO_SCREEN_COLOR_RED = 0x742A25;
static const uint32_t WIFI_INFO_SCREEN_COLOR_DIM = 0xD1D5DB;
static const uint32_t WIFI_INFO_SCREEN_COLOR_PANEL_BG = 0x050505;
static const uint32_t WIFI_INFO_SCREEN_COLOR_AQI = 0x1E4D35;
static const uint32_t WIFI_INFO_SCREEN_COLOR_DELTA = 0x0E2A63;
static const uint32_t WIFI_INFO_SCREEN_COLOR_NEUTRAL = 0x4B5563;

typedef struct {
    lv_obj_t *badge_panel;
    lv_obj_t *badge_label;
    lv_obj_t *badge_subtitle;
    lv_obj_t *main_panel;
    lv_obj_t *main_label;
    lv_obj_t *strip_panel;
    lv_obj_t *strip_fill_panel;
    lv_obj_t *strip_label;
    lv_obj_t *numeric_panel;
    lv_obj_t *numeric_fill_panel;
    lv_obj_t *numeric_value_label;
    lv_obj_t *numeric_caption_label;
    uint32_t badge_color_cache;
    uint32_t strip_color_cache;
} wifi_info_screen_board_row_t;

typedef struct {
    const char *badge_text_jp;
    uint32_t badge_color;
} wifi_info_screen_state_visual_t;

static wifi_info_screen_board_row_t s_primary_row;
static wifi_info_screen_board_row_t s_secondary_row;
static lv_obj_t *s_details_panel;
static lv_obj_t *s_details_label;
static lv_obj_t *s_wifi_indicator_dot;
static bool s_details_diagnostic_mode;
static bool s_screen_started;
static bool s_first_refresh_completed;
static bool s_fonts_ready;
static lv_font_t *s_font_small;
static lv_font_t *s_font_medium;
static lv_font_t *s_font_large;
static lv_font_t *s_font_numeric;
static lv_font_t *s_font_balance;
static lv_font_t *s_font_delta;
static network_service_snapshot_t s_snapshot_cache;
static provider_service_snapshot_t s_provider_snapshot_cache;
static char s_text_buffer[1536];
static int64_t s_last_delta_flash_marker;
static lv_timer_t *s_delta_flash_restore_timer;

extern const uint8_t jnr_sb_font_ttf_start[] asm("_binary_jnr_sb_font_ttf_start");
extern const uint8_t jnr_sb_font_ttf_end[] asm("_binary_jnr_sb_font_ttf_end");

static const char *wifi_info_screen_get_primary_text(const network_service_snapshot_t *snapshot);
static const char *wifi_info_screen_get_secondary_text(const network_service_snapshot_t *snapshot);
static void wifi_info_screen_appendf(size_t *offset, const char *format, ...);
static void wifi_info_screen_build_details_text(void);
static const char *wifi_info_screen_get_countdown_text(int64_t end_time_unix_seconds);
static uint32_t wifi_info_screen_get_progress_color(uint32_t progress);
static void wifi_info_screen_restore_delta_flash(lv_timer_t *timer);

static const char *wifi_info_screen_get_countdown_text(int64_t end_time_unix_seconds)
{
    static char buffer[24];
    if (end_time_unix_seconds <= 0) {
        snprintf(buffer, sizeof(buffer), "T-00:00:00");
        return buffer;
    }

    int64_t now = s_provider_snapshot_cache.last_fetch_unix_seconds;
    if ((now <= 0) || (s_provider_snapshot_cache.last_fetch_monotonic_us <= 0)) {
        snprintf(buffer, sizeof(buffer), "T-00:00:00");
        return buffer;
    }

    int64_t elapsed_us = esp_timer_get_time() - s_provider_snapshot_cache.last_fetch_monotonic_us;
    if (elapsed_us > 0) {
        now += elapsed_us / 1000000LL;
    }

    int64_t remaining = end_time_unix_seconds - now;
    if (remaining < 0) {
        remaining = 0;
    }

    int64_t hours = remaining / 3600;
    int64_t minutes = (remaining % 3600) / 60;
    int64_t seconds = remaining % 60;
    uint32_t display_hours = (uint32_t)(hours % 100LL);
    snprintf(buffer,
             sizeof(buffer),
             "T-%02" PRIu32 ":%02lld:%02lld",
             display_hours,
             minutes,
             seconds);
    return buffer;
}

static void wifi_info_screen_log_heap_snapshot(const char *phase)
{
    size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    size_t internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    size_t spiram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    size_t spiram_largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);

    ESP_LOGI(TAG,
             "Heap[%s] internal free=%u largest=%u, spiram free=%u largest=%u",
             phase,
             (unsigned)internal_free,
             (unsigned)internal_largest,
             (unsigned)spiram_free,
             (unsigned)spiram_largest);
}

static lv_display_t *wifi_info_screen_start_display(void)
{
    bsp_display_cfg_t display_cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = BSP_LCD_H_RES * WIFI_INFO_SCREEN_DRAW_BUFFER_LINES,
        .double_buffer = false,
        .flags = {
            .buff_dma = false,
            .buff_spiram = true,
            .sw_rotate = true,
        },
    };

