Minghou-Lei/esp32_ai_monitor/components/ui_service/monitor_dashboard_screen.c
    return bsp_display_start_with_config(&display_cfg);
}

static void wifi_info_screen_prepare_fonts(void)
{
    if (s_fonts_ready) {
        return;
    }

    size_t font_data_size = (size_t)(jnr_sb_font_ttf_end - jnr_sb_font_ttf_start);
    if (font_data_size == 0U) {
        ESP_LOGW(TAG, "Embedded font asset is empty");
        s_fonts_ready = true;
        return;
    }

    wifi_info_screen_log_heap_snapshot("before-fonts");

    s_font_small = lv_tiny_ttf_create_data(jnr_sb_font_ttf_start,
                                           font_data_size,
                                           WIFI_INFO_SCREEN_FONT_SIZE_SMALL);
    s_font_medium = lv_tiny_ttf_create_data(jnr_sb_font_ttf_start,
                                            font_data_size,
                                            WIFI_INFO_SCREEN_FONT_SIZE_MEDIUM);
    s_font_balance = lv_tiny_ttf_create_data(jnr_sb_font_ttf_start,
                                             font_data_size,
                                             WIFI_INFO_SCREEN_FONT_SIZE_BALANCE);
    s_font_delta = lv_tiny_ttf_create_data(jnr_sb_font_ttf_start,
                                           font_data_size,
                                           WIFI_INFO_SCREEN_FONT_SIZE_DELTA);

    s_font_large = s_font_medium;
    s_font_numeric = s_font_medium;
    if (s_font_balance == NULL) {
        s_font_balance = s_font_medium;
    }
    if (s_font_delta == NULL) {
        s_font_delta = s_font_medium;
    }

    if ((s_font_small == NULL) || (s_font_medium == NULL)) {
        ESP_LOGW(TAG, "Failed to create TinyTTF base fonts for station board layout");
    } else {
        ESP_LOGI(TAG,
                 "Loaded TinyTTF station fonts (%u bytes, %ld/%ld px, balance=%ld delta=%ld)",
                 (unsigned int)font_data_size,
                 (long)WIFI_INFO_SCREEN_FONT_SIZE_SMALL,
                 (long)WIFI_INFO_SCREEN_FONT_SIZE_MEDIUM,
                 (long)WIFI_INFO_SCREEN_FONT_SIZE_BALANCE,
                 (long)WIFI_INFO_SCREEN_FONT_SIZE_DELTA);
    }

    wifi_info_screen_log_heap_snapshot("after-fonts");
    s_fonts_ready = true;
}

static lv_obj_t *wifi_info_screen_create_panel(lv_obj_t *parent,
                                               int32_t width,
                                               int32_t height,
                                               uint32_t bg_color,
                                               uint32_t border_color)
{
    lv_obj_t *panel = lv_obj_create(parent);
    lv_obj_remove_style_all(panel);
    lv_obj_set_size(panel, width, height);
    lv_obj_set_style_bg_opa(panel, LV_OPA_COVER, 0);
    lv_obj_set_style_bg_color(panel, lv_color_hex(bg_color), 0);
    lv_obj_set_style_border_width(panel, 4, 0);
    lv_obj_set_style_border_color(panel, lv_color_hex(border_color), 0);
    lv_obj_set_style_radius(panel, 10, 0);
    lv_obj_set_style_pad_all(panel, 0, 0);
    lv_obj_clear_flag(panel, LV_OBJ_FLAG_SCROLLABLE);
    return panel;
}

static lv_obj_t *wifi_info_screen_create_label(lv_obj_t *parent, lv_font_t *font, uint32_t text_color)
{
    lv_obj_t *label = lv_label_create(parent);
    lv_obj_set_style_text_color(label, lv_color_hex(text_color), 0);
    if (font != NULL) {
        lv_obj_set_style_text_font(label, font, 0);
    }
    return label;
}

static void wifi_info_screen_set_panel_color_if_changed(lv_obj_t *panel,
                                                        uint32_t *color_cache,
                                                        uint32_t next_color)
{
    if ((panel == NULL) || (color_cache == NULL) || (*color_cache == next_color)) {
        return;
    }

    lv_obj_set_style_bg_color(panel, lv_color_hex(next_color), 0);
    *color_cache = next_color;
}

static void wifi_info_screen_set_label_text_if_changed(lv_obj_t *label, const char *text)
{
    if ((label == NULL) || (text == NULL)) {
        return;
    }

    const char *current_text = lv_label_get_text(label);
    if ((current_text != NULL) && (strcmp(current_text, text) == 0)) {
        return;
    }

    lv_label_set_text(label, text);
}

static void wifi_info_screen_create_board_row(wifi_info_screen_board_row_t *row,
                                              lv_obj_t *parent,
                                              int32_t y,
                                              int32_t height,
                                              int32_t strip_height,
                                              lv_font_t *main_font,
                                              lv_font_t *numeric_font)
{
    int32_t main_label_top = (height >= 240) ? 22 : ((height >= 180) ? 14 : 8);
    row->badge_color_cache = UINT32_MAX;
    row->strip_color_cache = UINT32_MAX;

    row->badge_panel = wifi_info_screen_create_panel(parent,
                                                     160,
                                                     height,
                                                     WIFI_INFO_SCREEN_COLOR_AMBER,
                                                     WIFI_INFO_SCREEN_COLOR_BORDER);
    lv_obj_align(row->badge_panel, LV_ALIGN_TOP_LEFT, 24, y);

    row->badge_label = wifi_info_screen_create_label(row->badge_panel,
                                                     s_font_large,
                                                     WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(row->badge_label, 136);
    lv_label_set_long_mode(row->badge_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_align(row->badge_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_line_space(row->badge_label, -10, 0);
    lv_obj_align(row->badge_label, LV_ALIGN_CENTER, 0, -18);

    row->badge_subtitle = wifi_info_screen_create_label(row->badge_panel,
                                                        s_font_small,
                                                        WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(row->badge_subtitle, 136);
    lv_obj_set_style_text_align(row->badge_subtitle, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(row->badge_subtitle, LV_ALIGN_BOTTOM_MID, 0, -14);

    row->main_panel = wifi_info_screen_create_panel(parent,
                                                    360,
                                                    height,
                                                    WIFI_INFO_SCREEN_COLOR_PANEL_BG,
                                                    WIFI_INFO_SCREEN_COLOR_BORDER);
    lv_obj_align(row->main_panel, LV_ALIGN_TOP_LEFT, 196, y);

    row->main_label = wifi_info_screen_create_label(row->main_panel,
                                                    main_font,
                                                    WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(row->main_label, 332);
    lv_label_set_long_mode(row->main_label, LV_LABEL_LONG_CLIP);
    lv_obj_set_style_text_align(row->main_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_line_space(row->main_label, -6, 0);
    lv_obj_align(row->main_label, LV_ALIGN_TOP_MID, 0, main_label_top);

    row->strip_panel = wifi_info_screen_create_panel(row->main_panel,
                                                     332,
                                                     strip_height,
                                                     WIFI_INFO_SCREEN_COLOR_PANEL_BG,
                                                     WIFI_INFO_SCREEN_COLOR_BORDER);
    lv_obj_align(row->strip_panel, LV_ALIGN_BOTTOM_MID, 0, -12);

    row->strip_fill_panel = wifi_info_screen_create_panel(row->strip_panel,
                                                          0,
                                                          strip_height - 8,
                                                          WIFI_INFO_SCREEN_COLOR_BLUE,
                                                          WIFI_INFO_SCREEN_COLOR_BLUE);
    lv_obj_set_style_border_width(row->strip_fill_panel, 0, 0);
    lv_obj_set_style_radius(row->strip_fill_panel, 6, 0);
    lv_obj_align(row->strip_fill_panel, LV_ALIGN_LEFT_MID, 0, 0);

    row->strip_label = wifi_info_screen_create_label(row->strip_panel,
                                                     s_font_medium,
                                                     WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(row->strip_label, 304);
    lv_label_set_long_mode(row->strip_label, LV_LABEL_LONG_CLIP);
    lv_obj_set_style_text_align(row->strip_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(row->strip_label, LV_ALIGN_CENTER, 0, 0);

    row->numeric_panel = wifi_info_screen_create_panel(parent,
                                                       128,
                                                       height,
                                                       WIFI_INFO_SCREEN_COLOR_PANEL_BG,
                                                       WIFI_INFO_SCREEN_COLOR_BORDER);
    lv_obj_align(row->numeric_panel, LV_ALIGN_TOP_LEFT, 568, y);

    row->numeric_fill_panel = wifi_info_screen_create_panel(row->numeric_panel,
                                                            120,
                                                            0,
                                                            WIFI_INFO_SCREEN_COLOR_BLUE,
                                                            WIFI_INFO_SCREEN_COLOR_BLUE);
    lv_obj_set_style_border_width(row->numeric_fill_panel, 0, 0);
    lv_obj_set_style_radius(row->numeric_fill_panel, 6, 0);
    lv_obj_align(row->numeric_fill_panel, LV_ALIGN_BOTTOM_MID, 0, -4);

    row->numeric_caption_label = wifi_info_screen_create_label(row->numeric_panel,
                                                               s_font_small,
                                                               WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(row->numeric_caption_label, 100);
    lv_obj_set_style_text_align(row->numeric_caption_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(row->numeric_caption_label, LV_ALIGN_TOP_MID, 0, 16);

    row->numeric_value_label = wifi_info_screen_create_label(row->numeric_panel,
                                                             numeric_font,
                                                             WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(row->numeric_value_label, 112);
    lv_obj_set_style_text_align(row->numeric_value_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(row->numeric_value_label, LV_ALIGN_CENTER, 0, 14);
}

static bool wifi_info_screen_has_value(const char *text)
{
    return (text != NULL) && (text[0] != '\0') && (strcmp(text, "-") != 0);
}

static void wifi_info_screen_format_delta_amount(const char *amount, char *buffer, size_t buffer_size)
{
    if ((buffer == NULL) || (buffer_size == 0U)) {
        return;
    }

    if (!wifi_info_screen_has_value(amount)) {
        snprintf(buffer, buffer_size, "-");
        return;
    }

    snprintf(buffer, buffer_size, (amount[0] == '-') ? "%s" : "-%s", amount);
}

static bool wifi_info_screen_has_subscription(const provider_service_item_t *item)
{
    return (item != NULL) && item->valid;
}

static const char *wifi_info_screen_get_short_end_time(const char *full_time)
{
    if ((full_time == NULL) || (strlen(full_time) < 16U)) {
        return "-";
    }

    return full_time + 5;
}

static uint32_t wifi_info_screen_get_aqi_badge_color(const provider_service_snapshot_t *snapshot,
                                                     const provider_service_item_t *item)
{
    if ((snapshot == NULL) || (item == NULL) || !item->valid) {
        return WIFI_INFO_SCREEN_COLOR_NEUTRAL;
    }

