Minghou-Lei/esp32_ai_monitor/components/ui_service/monitor_dashboard_screen.c
    if (snapshot->state == PROVIDER_SERVICE_STATE_ERROR) {
        return WIFI_INFO_SCREEN_COLOR_RED;
    }
    if ((item->used_percent >= 90U) || (strcmp(item->remaining_amount, "$0.00") == 0)) {
        return WIFI_INFO_SCREEN_COLOR_RED;
    }
    if (item->used_percent >= 70U) {
        return WIFI_INFO_SCREEN_COLOR_AMBER;
    }
    return WIFI_INFO_SCREEN_COLOR_GREEN;
}

static const char *wifi_info_screen_get_wifi_summary_state(const network_service_snapshot_t *snapshot)
{
    if (snapshot == NULL) {
        return "WIFI ?";
    }

    switch (snapshot->state) {
    case NETWORK_SERVICE_STATE_CONNECTED:
        return "WIFI READY";
    case NETWORK_SERVICE_STATE_CONNECTING:
        return "WIFI CONNECTING";
    case NETWORK_SERVICE_STATE_PORTAL_REQUIRED:
        return "WIFI PORTAL";
    case NETWORK_SERVICE_STATE_CONFIG_AP:
        return "CONFIG AP";
    case NETWORK_SERVICE_STATE_DISCONNECTED:
        return "WIFI DOWN";
    case NETWORK_SERVICE_STATE_UNCONFIGURED:
        return "WIFI UNCONFIGURED";
    case NETWORK_SERVICE_STATE_IDLE:
    default:
        return "WIFI IDLE";
    }
}

static const char *wifi_info_screen_get_interval_text(uint32_t seconds)
{
    static char buffer[24];
    if (seconds >= 3600U) {
        snprintf(buffer, sizeof(buffer), "%" PRIu32 "h%" PRIu32 "m", seconds / 3600U, (seconds % 3600U) / 60U);
    } else if (seconds >= 60U) {
        snprintf(buffer, sizeof(buffer), "%" PRIu32 "m%" PRIu32 "s", seconds / 60U, seconds % 60U);
    } else {
        snprintf(buffer, sizeof(buffer), "%" PRIu32 "s", seconds);
    }
    return buffer;
}

static void wifi_info_screen_format_token_compact(const char *token_text,
                                                  char *buffer,
                                                  size_t buffer_size)
{
    if ((buffer == NULL) || (buffer_size == 0U)) {
        return;
    }

    long long tokens = 0;
    if (token_text != NULL) {
        tokens = strtoll(token_text, NULL, 10);
    }

    if (tokens >= 1000000LL) {
        snprintf(buffer, buffer_size, "%.1fM", (double)tokens / 1000000.0);
    } else if (tokens >= 1000LL) {
        snprintf(buffer, buffer_size, "%.1fk", (double)tokens / 1000.0);
    } else {
        snprintf(buffer, buffer_size, "%lld", tokens);
    }
}

static void wifi_info_screen_format_token_delta_k(const char *token_text,
                                                  char *buffer,
                                                  size_t buffer_size)
{
    if ((buffer == NULL) || (buffer_size == 0U)) {
        return;
    }

    long long tokens = 0;
    if (token_text != NULL) {
        tokens = strtoll(token_text, NULL, 10);
    }

    double token_k = (double)tokens / 1000.0;
    snprintf(buffer, buffer_size, "-%.2fK", token_k);
}

static void wifi_info_screen_build_details_text(void)
{
    s_text_buffer[0] = '\0';
    size_t offset = 0;
    char delta_amount_text[PROVIDER_SERVICE_MONEY_TEXT_LEN + 2U];
    wifi_info_screen_format_delta_amount(s_provider_snapshot_cache.delta_used_amount,
                                         delta_amount_text,
                                         sizeof(delta_amount_text));

    if (!s_details_diagnostic_mode) {
        wifi_info_screen_appendf(&offset,
                                 "AQI %s / %s\n",
                                 s_provider_snapshot_cache.state_text,
                                 s_provider_snapshot_cache.status_text);
        wifi_info_screen_appendf(&offset,
                                 "%s / %s\n",
                                 wifi_info_screen_get_wifi_summary_state(&s_snapshot_cache),
                                 wifi_info_screen_get_primary_text(&s_snapshot_cache));
        wifi_info_screen_appendf(&offset,
                                 "IPV4 %s / RSSI %d dBm\n",
                                 s_snapshot_cache.ip,
                                 s_snapshot_cache.rssi);
        wifi_info_screen_appendf(&offset,
                                 "DELTA %s / %s",
                                 delta_amount_text,
                                 s_provider_snapshot_cache.delta_used_percent);
        return;
    }

    wifi_info_screen_appendf(&offset,
                             "AQI %s / %s / ACTIVE %" PRIu32 "\n",
                             s_provider_snapshot_cache.state_text,
                             s_provider_snapshot_cache.status_text,
                             s_provider_snapshot_cache.active_count);
    wifi_info_screen_appendf(&offset,
                             "AQI FETCH %" PRIu32 " / OK %" PRIu32 " / FAIL %" PRIu32 " / HTTP %ld\n",
                             s_provider_snapshot_cache.fetch_count,
                             s_provider_snapshot_cache.success_count,
                             s_provider_snapshot_cache.failure_count,
                             (long)s_provider_snapshot_cache.last_http_status);
    wifi_info_screen_appendf(&offset,
                             "DELTA %s / %s / Δ %s\n",
                             delta_amount_text,
                             s_provider_snapshot_cache.delta_used_percent,
                             wifi_info_screen_get_interval_text(s_provider_snapshot_cache.last_success_interval_seconds));
    wifi_info_screen_appendf(&offset,
                             "WIFI %s / STATUS %s\n",
                             s_snapshot_cache.state_text,
                             s_snapshot_cache.status_text);
    wifi_info_screen_appendf(&offset,
                             "SSID %s / IPV4 %s / RSSI %d dBm\n",
                             s_snapshot_cache.connected_ssid,
                             s_snapshot_cache.ip,
                             s_snapshot_cache.rssi);
    wifi_info_screen_appendf(&offset,
                             "HOST %s / AP %s\n",
                             s_snapshot_cache.hostname,
                             s_snapshot_cache.connected_ssid);
    wifi_info_screen_appendf(&offset,
                             "CONFIG AP %s / IP %s\n",
                             s_snapshot_cache.config_ap_ssid,
                             s_snapshot_cache.ap_ip);
    wifi_info_screen_appendf(&offset,
                             "CONFIG AP %s / PASS %s\n",
                             s_snapshot_cache.softap_active ? "ON" : "OFF",
                             s_snapshot_cache.softap_active
                                 ? ((s_snapshot_cache.config_ap_password[0] != '\0') ? s_snapshot_cache.config_ap_password
                                                                                     : "(open)")
                                  : "hold BOOT 2s");
    if (wifi_info_screen_has_subscription(&s_provider_snapshot_cache.items[0])) {
        const provider_service_item_t *primary = &s_provider_snapshot_cache.items[0];
        wifi_info_screen_appendf(&offset,
                                 "#%ld LEFT %s / TOTAL %s / USED %u%% / END %s\n",
                                 (long)primary->id,
                                 primary->remaining_amount,
                                 primary->total_amount,
                                 primary->used_percent,
                                 primary->end_time);
    }
}

static void wifi_info_screen_set_label_color_recursive(lv_obj_t *root, uint32_t color)
{
    if (root == NULL) {
        return;
    }

    lv_obj_set_style_text_color(root, lv_color_hex(color), 0);
    uint32_t child_count = lv_obj_get_child_count(root);
    for (uint32_t i = 0; i < child_count; ++i) {
        wifi_info_screen_set_label_color_recursive(lv_obj_get_child(root, i), color);
    }
}

static void wifi_info_screen_set_delta_flash_visual(bool inverted)
{
    uint32_t bg_color = inverted ? WIFI_INFO_SCREEN_COLOR_WHITE : WIFI_INFO_SCREEN_COLOR_PANEL_BG;
    uint32_t text_color = inverted ? WIFI_INFO_SCREEN_COLOR_BLACK : WIFI_INFO_SCREEN_COLOR_WHITE;

    lv_obj_set_style_bg_color(s_secondary_row.badge_panel, lv_color_hex(bg_color), 0);
    lv_obj_set_style_bg_color(s_secondary_row.main_panel, lv_color_hex(bg_color), 0);
    lv_obj_set_style_bg_color(s_secondary_row.numeric_panel, lv_color_hex(bg_color), 0);
    lv_obj_set_style_bg_color(s_secondary_row.strip_panel,
                              lv_color_hex(inverted ? WIFI_INFO_SCREEN_COLOR_WHITE
                                                    : WIFI_INFO_SCREEN_COLOR_PANEL_BG),
                              0);
    wifi_info_screen_set_label_color_recursive(s_secondary_row.badge_panel, text_color);
    wifi_info_screen_set_label_color_recursive(s_secondary_row.main_panel, text_color);
    wifi_info_screen_set_label_color_recursive(s_secondary_row.numeric_panel, text_color);
    wifi_info_screen_set_label_color_recursive(s_secondary_row.strip_panel,
                                               inverted ? WIFI_INFO_SCREEN_COLOR_BLACK
                                                        : WIFI_INFO_SCREEN_COLOR_WHITE);
    if (s_secondary_row.strip_fill_panel != NULL) {
        lv_obj_set_style_bg_color(s_secondary_row.strip_fill_panel,
                                  lv_color_hex(inverted ? WIFI_INFO_SCREEN_COLOR_WHITE
                                                        : WIFI_INFO_SCREEN_COLOR_DELTA),
                                  0);
    }
}

static uint32_t wifi_info_screen_get_delta_progress_percent(void)
{
    if (s_provider_snapshot_cache.refresh_interval_ms == 0U) {
        return 100U;
    }

