Minghou-Lei/esp32_ai_monitor/components/ui_service/monitor_dashboard_screen.c
    uint32_t remaining = s_provider_snapshot_cache.refresh_interval_ms;
    if (s_provider_snapshot_cache.last_fetch_monotonic_us > 0) {
        int64_t now_us = esp_timer_get_time();
        uint32_t elapsed_ms = (now_us > s_provider_snapshot_cache.last_fetch_monotonic_us)
                                  ? (uint32_t)((now_us - s_provider_snapshot_cache.last_fetch_monotonic_us) / 1000LL)
                                  : 0U;
        remaining = (elapsed_ms >= s_provider_snapshot_cache.refresh_interval_ms)
                        ? 0U
                        : (s_provider_snapshot_cache.refresh_interval_ms - elapsed_ms);
    }

    return (remaining * 100U) / s_provider_snapshot_cache.refresh_interval_ms;
}

static uint32_t wifi_info_screen_get_progress_color(uint32_t progress)
{
    if (progress >= 66U) {
        return WIFI_INFO_SCREEN_COLOR_GREEN;
    }
    if (progress >= 33U) {
        return WIFI_INFO_SCREEN_COLOR_AMBER;
    }
    return WIFI_INFO_SCREEN_COLOR_RED;
}

static void wifi_info_screen_update_delta_progress_fill(void)
{
    if ((s_secondary_row.strip_fill_panel == NULL) || (s_secondary_row.strip_panel == NULL)) {
        return;
    }

    uint32_t progress = wifi_info_screen_get_delta_progress_percent();
    uint32_t fill_width = (304U * progress) / 100U;
    uint32_t fill_color = wifi_info_screen_get_progress_color(progress);

    lv_obj_set_size(s_secondary_row.strip_fill_panel, (int32_t)fill_width, 34);
    lv_obj_align(s_secondary_row.strip_fill_panel, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_style_bg_color(s_secondary_row.strip_fill_panel, lv_color_hex(fill_color), 0);
}

static void wifi_info_screen_restore_delta_flash(lv_timer_t *timer)
{
    if (timer == s_delta_flash_restore_timer) {
        s_delta_flash_restore_timer = NULL;
    }

    wifi_info_screen_set_delta_flash_visual(false);
    wifi_info_screen_update_delta_progress_fill();
    lv_timer_delete(timer);
}

static uint32_t wifi_info_screen_get_primary_available_percent(const provider_service_item_t *item)
{
    if (!wifi_info_screen_has_subscription(item)) {
        return 0U;
    }

    // Provider 快照提供的是 used_percent，主卡右侧显示的是剩余额度百分比。
    return (item->used_percent >= 100U) ? 0U : (100U - item->used_percent);
}

static void wifi_info_screen_update_primary_available_fill(const provider_service_item_t *item)
{
    if ((s_primary_row.numeric_fill_panel == NULL) || (s_primary_row.numeric_panel == NULL)) {
        return;
    }

    uint32_t available_percent = wifi_info_screen_get_primary_available_percent(item);
    int32_t fill_width = lv_obj_get_width(s_primary_row.numeric_panel) - 8;
    int32_t fill_height = ((lv_obj_get_height(s_primary_row.numeric_panel) - 8) * (int32_t)available_percent) / 100;

    if (fill_width < 0) {
        fill_width = 0;
    }
    if (fill_height < 0) {
        fill_height = 0;
    }

    lv_obj_set_size(s_primary_row.numeric_fill_panel, fill_width, fill_height);
    lv_obj_align(s_primary_row.numeric_fill_panel, LV_ALIGN_BOTTOM_MID, 0, -4);
    lv_obj_set_style_bg_color(s_primary_row.numeric_fill_panel,
                              lv_color_hex(wifi_info_screen_get_progress_color(available_percent)),
                              0);
}

static void wifi_info_screen_handle_primary_touch(lv_event_t *event)
{
    (void)event;
    if (provider_service_request_refresh() != ESP_OK) {
        ESP_LOGW(TAG, "Manual provider refresh request failed");
    }
}

static void wifi_info_screen_handle_details_touch(lv_event_t *event)
{
    (void)event;
    s_details_diagnostic_mode = !s_details_diagnostic_mode;
    wifi_info_screen_build_details_text();
    wifi_info_screen_set_label_text_if_changed(s_details_label, s_text_buffer);
}

static wifi_info_screen_state_visual_t wifi_info_screen_get_state_visual(
    const network_service_snapshot_t *snapshot)
{
    switch (snapshot->state) {
    case NETWORK_SERVICE_STATE_CONNECTED:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "接続", .badge_color = WIFI_INFO_SCREEN_COLOR_GREEN};
    case NETWORK_SERVICE_STATE_CONNECTING:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "接続中",
                                                 .badge_color = WIFI_INFO_SCREEN_COLOR_AMBER};
    case NETWORK_SERVICE_STATE_PORTAL_REQUIRED:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "放行待ち",
                                                 .badge_color = WIFI_INFO_SCREEN_COLOR_AMBER};
    case NETWORK_SERVICE_STATE_DISCONNECTED:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "切断", .badge_color = WIFI_INFO_SCREEN_COLOR_RED};
    case NETWORK_SERVICE_STATE_UNCONFIGURED:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "未設定",
                                                 .badge_color = WIFI_INFO_SCREEN_COLOR_RED};
    case NETWORK_SERVICE_STATE_CONFIG_AP:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "設定AP",
                                                 .badge_color = WIFI_INFO_SCREEN_COLOR_BLUE};
    case NETWORK_SERVICE_STATE_IDLE:
    default:
        return (wifi_info_screen_state_visual_t){.badge_text_jp = "待機", .badge_color = WIFI_INFO_SCREEN_COLOR_BLUE};
    }
}

static const char *wifi_info_screen_get_primary_text(const network_service_snapshot_t *snapshot)
{
    if (wifi_info_screen_has_value(snapshot->connected_ssid)) {
        return snapshot->connected_ssid;
    }

    if (wifi_info_screen_has_value(snapshot->configured_ssid)) {
        return snapshot->configured_ssid;
    }

    return "NO SSID";
}

static const char *wifi_info_screen_get_secondary_text(const network_service_snapshot_t *snapshot)
{
    if (snapshot->ip_ready && wifi_info_screen_has_value(snapshot->ip)) {
        return snapshot->ip;
    }

    return "NO ADDRESS";
}

static void wifi_info_screen_appendf(size_t *offset, const char *format, ...)
{
    if ((offset == NULL) || (*offset >= sizeof(s_text_buffer))) {
        return;
    }

    va_list args;
    va_start(args, format);
    int written = vsnprintf(&s_text_buffer[*offset], sizeof(s_text_buffer) - *offset, format, args);
    va_end(args);

