Minghou-Lei/esp32_ai_monitor/components/ui_service/monitor_dashboard_screen.c
    if (written <= 0) {
        return;
    }

    size_t remaining = sizeof(s_text_buffer) - *offset;
    if ((size_t)written >= remaining) {
        *offset = sizeof(s_text_buffer) - 1;
        return;
    }

    *offset += (size_t)written;
}

static void wifi_info_screen_refresh(lv_timer_t *timer)
{
    if ((s_primary_row.badge_panel == NULL) || (s_secondary_row.badge_panel == NULL)
        || (s_details_label == NULL)) {
        return;
    }

    if (!s_first_refresh_completed) {
        wifi_info_screen_log_heap_snapshot("first-refresh");
    }

    network_service_get_snapshot(&s_snapshot_cache);
    provider_service_get_snapshot(&s_provider_snapshot_cache);

    const provider_service_item_t *primary_subscription = &s_provider_snapshot_cache.items[0];
    char delta_amount_text[PROVIDER_SERVICE_MONEY_TEXT_LEN + 2U];
    wifi_info_screen_format_delta_amount(s_provider_snapshot_cache.delta_used_amount,
                                         delta_amount_text,
                                         sizeof(delta_amount_text));

    if (s_wifi_indicator_dot != NULL) {
        if (s_snapshot_cache.softap_active) {
            lv_obj_clear_flag(s_wifi_indicator_dot, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(s_wifi_indicator_dot, LV_OBJ_FLAG_HIDDEN);
        }
    }

    wifi_info_screen_set_panel_color_if_changed(s_primary_row.badge_panel,
                                                &s_primary_row.badge_color_cache,
                                                wifi_info_screen_get_aqi_badge_color(&s_provider_snapshot_cache,
                                                                                     primary_subscription));
    wifi_info_screen_set_label_text_if_changed(s_primary_row.badge_label, "AQI");
    wifi_info_screen_set_label_text_if_changed(s_primary_row.badge_subtitle,
                                               s_provider_snapshot_cache.state == PROVIDER_SERVICE_STATE_FETCHING
                                                   ? "REFRESHING"
                                                   : (wifi_info_screen_has_subscription(primary_subscription)
                                                          ? "SUB ACTIVE"
                                                          : s_provider_snapshot_cache.state_text));
    wifi_info_screen_set_label_text_if_changed(s_primary_row.main_label,
                                               wifi_info_screen_has_subscription(primary_subscription)
                                                   ? primary_subscription->remaining_amount
                                                   : "NO ACTIVE SUB");

    char primary_strip_text[128];
    if (wifi_info_screen_has_subscription(primary_subscription)) {
        snprintf(primary_strip_text,
                 sizeof(primary_strip_text),
                 "%s",
                 wifi_info_screen_get_countdown_text(primary_subscription->end_time_unix_seconds));
    } else {
        snprintf(primary_strip_text, sizeof(primary_strip_text), "%s", s_provider_snapshot_cache.status_text);
    }
    wifi_info_screen_set_label_text_if_changed(s_primary_row.strip_label, primary_strip_text);

    char primary_percent_text[8];
    if (wifi_info_screen_has_subscription(primary_subscription)) {
        snprintf(primary_percent_text,
                 sizeof(primary_percent_text),
                 "%" PRIu32 "%%",
                 wifi_info_screen_get_primary_available_percent(primary_subscription));
    } else {
        snprintf(primary_percent_text, sizeof(primary_percent_text), "--");
    }
    wifi_info_screen_update_primary_available_fill(primary_subscription);
    wifi_info_screen_set_label_text_if_changed(s_primary_row.numeric_value_label, primary_percent_text);

    wifi_info_screen_set_panel_color_if_changed(s_secondary_row.badge_panel,
                                                &s_secondary_row.badge_color_cache,
                                                (s_provider_snapshot_cache.delta_used_raw > 0)
                                                    ? WIFI_INFO_SCREEN_COLOR_AMBER
                                                    : WIFI_INFO_SCREEN_COLOR_BLUE);
    wifi_info_screen_set_panel_color_if_changed(s_secondary_row.strip_panel,
                                                &s_secondary_row.strip_color_cache,
                                                WIFI_INFO_SCREEN_COLOR_PANEL_BG);
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.badge_label, "DELTA");
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.badge_subtitle, "SINCE LAST OK");
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.main_label, delta_amount_text);
    wifi_info_screen_update_delta_progress_fill();

    char secondary_strip_text[128];
    char secondary_token_text[24];
    wifi_info_screen_format_token_delta_k(s_provider_snapshot_cache.delta_used_tokens,
                                          secondary_token_text,
                                          sizeof(secondary_token_text));
    snprintf(secondary_strip_text,
             sizeof(secondary_strip_text),
             "Δ %s / %s",
             wifi_info_screen_get_interval_text(s_provider_snapshot_cache.last_success_interval_seconds),
             secondary_token_text);
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.strip_label, secondary_strip_text);

    wifi_info_screen_set_label_text_if_changed(s_secondary_row.numeric_caption_label, "$ / Hour");
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.numeric_value_label,
                                               s_provider_snapshot_cache.hourly_used_amount);

    if ((s_provider_snapshot_cache.last_success_interval_seconds > 0U)
        && (s_provider_snapshot_cache.last_fetch_unix_seconds != s_last_delta_flash_marker)) {
        s_last_delta_flash_marker = s_provider_snapshot_cache.last_fetch_unix_seconds;
        wifi_info_screen_set_delta_flash_visual(true);
        if (s_delta_flash_restore_timer != NULL) {
            lv_timer_delete(s_delta_flash_restore_timer);
        }
        s_delta_flash_restore_timer =
            lv_timer_create(wifi_info_screen_restore_delta_flash, WIFI_INFO_SCREEN_DELTA_FLASH_MS, NULL);
        if (s_delta_flash_restore_timer == NULL) {
            wifi_info_screen_set_delta_flash_visual(false);
            wifi_info_screen_update_delta_progress_fill();
        }
    } else if (s_delta_flash_restore_timer == NULL) {
        wifi_info_screen_set_delta_flash_visual(false);
        wifi_info_screen_update_delta_progress_fill();
    }

    wifi_info_screen_build_details_text();
    wifi_info_screen_set_label_text_if_changed(s_details_label, s_text_buffer);

    if ((timer != NULL) && !s_first_refresh_completed) {
        s_first_refresh_completed = true;
        lv_timer_set_period(timer, CONFIG_AI_MONITOR_UI_REFRESH_MS);
    }
}

static void wifi_info_screen_create_layout(void)
{
    wifi_info_screen_prepare_fonts();

    lv_obj_t *screen = lv_screen_active();
    lv_obj_set_style_bg_color(screen, lv_color_hex(WIFI_INFO_SCREEN_COLOR_BLACK), 0);
    lv_obj_set_style_bg_opa(screen, LV_OPA_COVER, 0);
    wifi_info_screen_create_board_row(&s_primary_row,
                                      screen,
                                      24,
                                      264,
                                      54,
                                      s_font_balance,
                                      s_font_medium);
    wifi_info_screen_create_board_row(&s_secondary_row,
                                      screen,
                                      304,
                                      180,
                                      42,
                                      s_font_delta,
                                      s_font_medium);
    wifi_info_screen_set_panel_color_if_changed(s_secondary_row.badge_panel,
                                                &s_secondary_row.badge_color_cache,
                                                WIFI_INFO_SCREEN_COLOR_DELTA);
    wifi_info_screen_set_panel_color_if_changed(s_secondary_row.strip_panel,
                                                &s_secondary_row.strip_color_cache,
                                                WIFI_INFO_SCREEN_COLOR_BLUE);
    wifi_info_screen_set_panel_color_if_changed(s_primary_row.badge_panel,
                                                &s_primary_row.badge_color_cache,
                                                WIFI_INFO_SCREEN_COLOR_AQI);
    wifi_info_screen_set_panel_color_if_changed(s_primary_row.strip_panel,
                                                &s_primary_row.strip_color_cache,
                                                WIFI_INFO_SCREEN_COLOR_BLUE);
    wifi_info_screen_set_label_text_if_changed(s_primary_row.numeric_caption_label, "Avail %");
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.badge_label, "DELTA");
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.badge_subtitle, "SINCE LAST OK");
    wifi_info_screen_set_label_text_if_changed(s_secondary_row.numeric_caption_label, "$ / Hour");
    lv_obj_add_flag(s_primary_row.badge_panel, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_flag(s_primary_row.main_panel, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_flag(s_primary_row.numeric_panel, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(s_primary_row.badge_panel, wifi_info_screen_handle_primary_touch, LV_EVENT_CLICKED, NULL);
    lv_obj_add_event_cb(s_primary_row.main_panel, wifi_info_screen_handle_primary_touch, LV_EVENT_CLICKED, NULL);
    lv_obj_add_event_cb(s_primary_row.numeric_panel, wifi_info_screen_handle_primary_touch, LV_EVENT_CLICKED, NULL);

    s_details_panel = wifi_info_screen_create_panel(screen,
                                                    672,
                                                    156,
                                                    WIFI_INFO_SCREEN_COLOR_PANEL_BG,
                                                    WIFI_INFO_SCREEN_COLOR_BORDER);
    lv_obj_align(s_details_panel, LV_ALIGN_TOP_LEFT, 24, 500);
    lv_obj_add_flag(s_details_panel, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(s_details_panel, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_set_scroll_dir(s_details_panel, LV_DIR_VER);
    lv_obj_set_scrollbar_mode(s_details_panel, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_style_pad_top(s_details_panel, 10, 0);
    lv_obj_set_style_pad_bottom(s_details_panel, 10, 0);
    lv_obj_add_event_cb(s_details_panel, wifi_info_screen_handle_details_touch, LV_EVENT_CLICKED, NULL);

    lv_obj_t *details_title = wifi_info_screen_create_label(s_details_panel,
                                                            s_font_medium,
                                                            WIFI_INFO_SCREEN_COLOR_DIM);
    lv_label_set_text(details_title, "STATUS / TAP FOR DIAG");
    lv_obj_align(details_title, LV_ALIGN_TOP_LEFT, 14, 10);

