Minghou-Lei/esp32_ai_monitor/components/ui_service/monitor_dashboard_screen.c
    s_details_label = wifi_info_screen_create_label(s_details_panel,
                                                    s_font_small,
                                                    WIFI_INFO_SCREEN_COLOR_WHITE);
    lv_obj_set_width(s_details_label, 636);
    lv_label_set_long_mode(s_details_label, LV_LABEL_LONG_WRAP);
    lv_obj_align(s_details_label, LV_ALIGN_TOP_LEFT, 14, 50);
    lv_label_set_text(s_details_label, "AQI and Wi-Fi board loading...");

    s_wifi_indicator_dot = lv_obj_create(screen);
    lv_obj_remove_style_all(s_wifi_indicator_dot);
    lv_obj_set_size(s_wifi_indicator_dot, WIFI_INFO_SCREEN_WIFI_DOT_SIZE, WIFI_INFO_SCREEN_WIFI_DOT_SIZE);
    lv_obj_set_style_bg_opa(s_wifi_indicator_dot, LV_OPA_COVER, 0);
    lv_obj_set_style_bg_color(s_wifi_indicator_dot, lv_color_hex(WIFI_INFO_SCREEN_COLOR_WIFI_DOT), 0);
    lv_obj_set_style_radius(s_wifi_indicator_dot, WIFI_INFO_SCREEN_WIFI_DOT_SIZE / 2, 0);
    lv_obj_set_style_border_width(s_wifi_indicator_dot, 0, 0);
    lv_obj_align(s_wifi_indicator_dot, LV_ALIGN_TOP_LEFT, 654, 516);
    lv_obj_add_flag(s_wifi_indicator_dot, LV_OBJ_FLAG_HIDDEN);

    lv_timer_create(wifi_info_screen_refresh, WIFI_INFO_SCREEN_FIRST_REFRESH_MS, NULL);
}

esp_err_t wifi_info_screen_start(void)
{
    if (s_screen_started) {
        return ESP_OK;
    }

#if !CONFIG_SPIRAM
    ESP_LOGE(TAG, "PSRAM is disabled. Enable it in SDK Configuration editor before starting the display.");
    return ESP_ERR_NOT_SUPPORTED;
#endif

    lv_display_t *display = wifi_info_screen_start_display();
    if (display == NULL) {
        ESP_LOGE(TAG, "bsp_display_start_with_config() failed");
        return ESP_FAIL;
    }

    ESP_RETURN_ON_ERROR(bsp_display_backlight_on(), TAG, "failed to enable display backlight");

    if (!bsp_display_lock(0)) {
        ESP_LOGE(TAG, "Failed to lock LVGL mutex");
        return ESP_ERR_TIMEOUT;
    }

    wifi_info_screen_create_layout();
    bsp_display_unlock();

    s_screen_started = true;
    ESP_LOGI(TAG, "Wi-Fi detail screen started on display=%p", (void *)display);
    return ESP_OK;
}
